# Project One: Climate Change - Earth Surface Temperature

In [ ]:
#1.	What’s the global average yearly temperature movements over the last 10 or 11 decades?
#a.	Assumption: The global average yearly temperature has increased
#2.	Is there a correlation between global population growth and temperature rise?
#3.	If the temperature movements across the last 10 or 11 decades were different between the Northern and Southern hemisphere.
#4.	Which are the top 10 countries that experienced the maximum average yearly temperature shifts?
#a.	With the highest temperature rise and looking for any causes or any policies they have adopted.
#5.	Which are the bottom 10 countries that had the least change in average yearly temperatures?
#6.	Looking at Australia, what’re the changes in yearly temperature in the last 10 or 11 decades?
#7.	Compare between Melbourne and Sydney, are there differences between the movements of average yearly temperature?

## Data Cleanup

In [ ]:
#Clean up the CSV
#Split the first column by year, month and day
#Drop month and day columns
#Drop all data prior to 1913
#Drop blanks
#Groupby Year & Country
#Average of the average temperature
#Groupby Year(World Dataframe)
#Dataframe to be used

## Analysis

In [2]:
# Global average yearly temperature movements over the last 10 decades
# 
import pandas as pd

In [44]:
global_temp = pd.read_csv('GlobalLandTemperaturesByCountry 4.csv',parse_dates=["dt"], index_col="dt")
global_temp["Year"] = global_temp.index.year
global_temp.head()

            AverageTemperature  AverageTemperatureUncertainty Country  Year
dt
1743-11-01               4.384                          2.294   Åland  1743
1743-12-01                 NaN                            NaN   Åland  1743
1744-01-01                 NaN                            NaN   Åland  1744
1744-02-01                 NaN                            NaN   Åland  1744
1744-03-01                 NaN                            NaN   Åland  1744

In [47]:
global_temp.dtypes
#global_temp["Year"] = pd.to_numeric(global_temp["Year"], downcast="float")
#global_temp.dtypes
filtered_df = global_temp.loc[global_temp["Year"]>=1913]
filtered_df

            AverageTemperature  AverageTemperatureUncertainty   Country  Year
dt
1913-01-01              -2.742                          0.606     Åland  1913
1913-02-01              -0.599                          0.359     Åland  1913
1913-03-01               0.925                          0.276     Åland  1913
1913-04-01               3.138                          0.458     Åland  1913
1913-05-01               7.319                          0.486     Åland  1913
...                        ...                            ...       ...   ...
2013-05-01              19.059                          1.022  Zimbabwe  2013
2013-06-01              17.613                          0.473  Zimbabwe  2013
2013-07-01              17.000                          0.453  Zimbabwe  2013
2013-08-01              19.759                          0.717  Zimbabwe  2013
2013-09-01                 NaN                            NaN  Zimbabwe  2013

[292500 rows x 4 columns]

In [57]:
filtered_df.dropna(inplace=True)

<ipython-input-57-c4c3389a5a7a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df.dropna(inplace=True)

            AverageTemperature  AverageTemperatureUncertainty   Country  Year
dt
1913-01-01              -2.742                          0.606     Åland  1913
1913-02-01              -0.599                          0.359     Åland  1913
1913-03-01               0.925                          0.276     Åland  1913
1913-04-01               3.138                          0.458     Åland  1913
1913-05-01               7.319                          0.486     Åland  1913
...                        ...                            ...       ...   ...
2013-04-01              21.142                          0.495  Zimbabwe  2013
2013-05-01              19.059                          1.022  Zimbabwe  2013
2013-06-01              17.613                          0.473  Zimbabwe  2013
2013-07-01              17.000                          0.453  Zimbabwe  2013
2013-08-01              19.759                          0.717  Zimbabwe  2013

[291501 rows x 4 columns]

In [65]:
yearlyglobal=filtered_df.groupby("Year").agg({"AverageTemperature":"mean"})
yearlyglobal

      AverageTemperature
Year
1913           18.491490
1914           18.660602
1915           18.711240
1916           18.551877
1917           18.242554
...                  ...
2009           19.546385
2010           19.629806
2011           19.456040
2012           19.468744
2013           19.877007

[101 rows x 1 columns]